Revit 2015 API
EnergyAnalysisSurface Methods
The EnergyAnalysisSurface type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAdjacentAnalyticalSpace
 Gets the secondary adjacent analytical space this surface is associated with.
GetAnalyticalOpenings
 Returns the analytical openings of the analytical surface.
GetAnalyticalSpace
 Gets the primary analytical space this surface is associated with.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetPolyloop
 Gets the planar polygon describing the opening geometry.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace